app/controllers/add_friend_controller.rb

  def addFriend
    Friend.new do |f|
    	f.user_1 = params['userId']
    	f.user_2 = params['friendId']

    	f.save
---
INSERT INTO "friends" ("created_at", "updated_at", "user_1", "user_2") VALUES (?, ?, ?, ?)  [["created_at", Sat, 24 May 2014 14:28:38 UTC +00:00], ["updated_at", Sat, 24 May 2014 14:28:38 UTC +00:00], ["user_1", 1], ["user_2", 2]]