app/controllers/change_profile_picture_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = 1 ORDER BY "users"."id" ASC LIMIT 1
UPDATE "users" SET "profilePicture" = ?, "updated_at" = ? WHERE "users"."id" = 1  [["profilePicture", "/avatars/1_04700.png"], ["updated_at", Sun, 25 May 2014 12:30:14 UTC +00:00]]
---
  def changeProfilePicture
  	userId = params['userId']
  	profilePicture = params['file']


  	puts "coś jest do cholery nie tak!"

  	userPath = "/avatars/#{userId}_#{Random.rand(10000).to_s.rjust(5, "0")}.png"
  	servicePath = "public" + userPath

	File.open(servicePath, "wb") { |f| f.write(profilePicture.read) }

	User.where(id: userId).each do |u|
		old = u.profilePicture

		u.profilePicture = userPath
		u.save