app/controllers/confirm_controller.rb

  def confirm
  	puts "Code: #{params["code"]}"

  	unc = UserNotConfirmed.where(code: params["code"]).first

  	if unc
  		unc.delete()
---
SELECT "users_not_confirmed".* FROM "users_not_confirmed" WHERE "users_not_confirmed"."code" = 'W5E1NI8UAB47VTP18' ORDER BY "users_not_confirmed"."id" ASC LIMIT 1
DELETE FROM "users_not_confirmed" WHERE "users_not_confirmed"."id" = 2