app/controllers/get_countries_controller.rb

SELECT "countries".* FROM "countries" ORDER BY "countries"."id" ASC LIMIT 1000
---
  def getCountries
 		user = params

        countries = []
        Country.find_each do |c|