app/controllers/get_messages_controller.rb

SELECT "messages".* FROM "messages" WHERE "messages"."from" IN (1, 2) AND "messages"."to" IN (1, 2)
SELECT "new_messages".* FROM "new_messages" WHERE "new_messages"."id" = 3 ORDER BY "new_messages"."id" ASC LIMIT 1
---
	def getMessages
        ids = [params['userId'], params['friendId']]

        messages = []
        Message.where(:from => ids, :to => ids).each do |message|
            if !NewMessage.where(id: message.id).first