app/controllers/get_new_messages_controller.rb

SELECT "new_messages".* FROM "new_messages" WHERE "new_messages"."to" IS NULL ORDER BY "new_messages"."dateInserted" ASC
DELETE FROM "new_messages" WHERE "new_messages"."id" = 3
---
  def getNewMessages
  		userId = params['userId']

        messages = []
        NewMessage.where(to: userId).order(:dateInserted).each do |m|
        	message = m.attributes
            message['date'] = message['dateInserted'].strftime("%Y-%m-%d %H:%M:%S")
            messages.append(message)

            NewMessage.delete(message['id'])