app/controllers/get_friend_list_controller.rb

	def getFriendList
		user = User.where(id: params['userId']).first
---
SELECT "users".* FROM "users" WHERE "users"."id" = 1 ORDER BY "users"."id" ASC LIMIT 1