app/controllers/localization_controller.rb

SELECT "localizations".* FROM "localizations" WHERE "localizations"."localization" = 'pl-pl'
SELECT "localizations".* FROM "localizations" WHERE "localizations"."fieldName" = 'languageName'
---
  def localization
  	puts params # w tej zmiennej są dostępne post parametry
  	response = {}

  	if params["locale"] #fetch localization data
  		localization = {}
  		Localization.where(localization: params["locale"]).each do |l|
  			localization[l.fieldName] = l.value
  		end
  		response = localization

  	else # fetch only available languages
  		localization = []
  		Localization.where(fieldName: "languageName").each do |l|