app/controllers/login_controller.rb

  def login
	if !params['email'] and params['password']
		render :json => {"null" => "true"}
		return
	end

	user = User.where(email: params['email'], password: params['password']).first

	if user
		if !UserNotConfirmed.where(userId: user.id).first
---
SELECT "users".* FROM "users" WHERE "users"."email" = 'szymonkudzia@gmail.com' AND "users"."password" IS NULL ORDER BY "users"."id" ASC LIMIT 1
SELECT "users_not_confirmed".* FROM "users_not_confirmed" WHERE "users_not_confirmed"."userId" = 11 ORDER BY "users_not_confirmed"."id" ASC LIMIT 1