app/controllers/register_controller.rb

  def register
  		u = params

		user = User.new()

		user.email = u['email']
  		user.password = u['password']
  		user.country = u['country']
  		user.birthdate = u['birthdate']
  		user.firstName = u['firstName']
  		user.lastName = u['lastName']

  		user.save()

  		puts user.id

  		code = code_generator(15) + user.id.to_s

  		unc = UserNotConfirmed.new()
  		unc.userId = user.id
  		unc.code = code
  		unc.save()
---
INSERT INTO "users" ("birthdate", "country", "created_at", "firstName", "lastName", "men", "password", "profilePicture", "sex", "updated_at", "women") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
INSERT INTO "users_not_confirmed" ("code", "created_at", "updated_at", "userId") VALUES (?, ?, ?, ?)  [["code", "Z4BLHPX53E218UN16"], ["created_at", Mon, 12 May 2014 19:40:00 UTC +00:00], ["updated_at", Mon, 12 May 2014 19:40:00 UTC +00:00], ["userId", 16]]