app/controllers/search_people_controller.rb

SELECT "interests".* FROM "interests" WHERE "interests"."type" = 1 AND "interests"."userId" = 1
SELECT "users".* FROM "users" WHERE ((sex = 1 or sex = 2) AND (country = 'pl-pl' or country = 'en-us'))
---
    def searchPeople
        user = params['user']
        data = params['data']

        people = User.findPeople(data['countries'], data['interests'], data['lowerAge'], data['upperAge'], data['men'], data['women'])