app/controllers/send_message_controller.rb

  def sendMessage
  		data = params

  		newMessage = NewMessage.new do |m|
	  		m.from = params['userId']
	  		m.to = params['friendId']
	  		m.message = params['message']

	  		m.save
---
INSERT INTO "new_messages" ("created_at", "from", "message", "to", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", Sat, 24 May 2014 15:32:59 UTC +00:00], ["from", 2], ["message", "hej"], ["to", 1], ["updated_at", Sat, 24 May 2014 15:32:59 UTC +00:00]]