app/controllers/update_user_controller.rb

  def updateUser
  	user = params

  	u = User.where(id: user['id']).first
    puts u.attributes

    if u
    	u.email = user['email']
    	u.country = user['country']

      if user['birthdate']
    	 u.birthdate = Time.strptime(user['birthdate'], "%Y-%m-%d %H:%M:%S")
      end

    	u.firstName = user['firstName']
    	u.lastName = user['lastName']
    	u.profilePicture = user['profilePicture']
    	u.men = user['men']
    	u.women = user['women']
    	u.sex = user['sex']
    	u.aboutMe = user['aboutMe']
    	u.telephone = user['telephone']
    	u.facebook = user['facebook']
    	u.googlep = user['googlep']

    	u.save

      if user['countries']
        Interest.delete_all(userId: u.id, interes_type: 1)
---
SELECT "users".* FROM "users" WHERE "users"."id" = 1 ORDER BY "users"."id" ASC LIMIT 1
UPDATE "users" SET "profilePicture" = ?, "updated_at" = ? WHERE "users"."id" = 1  [["profilePicture", "/avatars/1_04024.png"], ["updated_at", Sun, 25 May 2014 12:20:38 UTC +00:00]]
DELETE FROM "interests" WHERE "interests"."userId" = 1 AND "interests"."interes_type" = 1

            interest.interes_type = 1
            interest.interest = country

            interest.save
---
INSERT INTO "interests" ("created_at", "interes_type", "interest", "updated_at", "userId") VALUES (?, ?, ?, ?, ?)  [["created_at", Sun, 25 May 2014 12:31:54 UTC +00:00], ["interes_type", 1], ["interest", "pl-pl"], ["updated_at", Sun, 25 May 2014 12:31:54 UTC +00:00], ["userId", 1]]